app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `created_at`) VALUES('8919975acc10779556e2922b67438c21654cb1cc', '2009-11-25 19:21:08', '9fd47f8f8d84001f98b5e75a9145cebf41e68b58', NULL, NULL, 'amit', '2009-11-25 19:21:08')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save